const inventory = [];
let room = "Вход";
let balance = 0;
let lever = false;

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

alert(
    "ЗАТЕРЯННОЕ КОРОЛЕВСТВО\n\n" +
    "Найдите зал босса и соберите вещи для упрощения битвы с ним:\n" +
    "ключ, магическую траву, магический меч, защитный амулет и священную лампу."
);

while (true) {
    if (room === "Вход") {
        const choice = prompt(
            "ВЫ У ВХОДА\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть мешок\n" +
            "3 — Осмотреть сундук\n" +
            "4 — Тюрьма - Западный коридор\n" +
            "5 — Центральный коридор\n" +
            "6 — Восточный коридор\n" +
            "7 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Горшок пуст.")
        } else if (choice === "2") {
            alert("Вы нашли 5 монет.")
            balance += 5
        } else if (choice === "3") {
            alert("Сундук пуст.")
        } else if (choice === "4") {
            room = "Западный коридор"
        } else if (choice === "5") {
            room = "Центральный коридор"
        } else if (choice === "6") {
            room = "Восточный коридор"
        } else if (choice == "7") {
            showInventory();
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Западный коридор") {
        const choice = prompt(
            "ВЫ В ТЮРЬМЕ - ЗАПАДНОМ КОРИДОРЕ\n" +
            "1 — Осмотреть камеру №1\n" +
            "2 — Осмотреть камеру №2\n" +
            "3 — Осмотреть камеру №3\n" +
            "4 — Зайти в зал испытания\n" +
            "5 — Продолжить движение по западному коридору\n" +
            "6 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы обыскали камеру №1 и нашли под кроватью 10 монет")
            balance += 10
        } else if (choice === "2") {
            alert("Вы обыскали камеру №2 и ничего в ней не нашли")
        } else if (choice === "3") {
            alert("Вы обыскали камеру №3 и нашли магическую траву")
            inventory.push("Магическая трава")
        } else if (choice === "4") {
            room = "Зал испытаний"
        } else if (choice === "5") {
            room = "Коридор после тюрьмы"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Центральный коридор") {
        const choice = prompt(
            "ВЫ В ЦЕНТРАЛЬНОМ КОРИДОРЕ\n" +
            "1 — Использовать рычаг (может нести последствия)\n" +
            "2 — Обыскать балкон\n" +
            "3 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы дёрнули за рычаг и что-то произошло")
            lever = true
        } else if (choice === "2") {
            alert("Вы нашли священную лампу")
            inventory.push("Священная лампа")
        } else if (choice === "3") {
            showInventory();
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Восточный коридор") {
        const choice = prompt(
            "ВЫ В ВОСТОЧНОМ КОРИДОРЕ\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть кирпич в стене\n" +
            "3 — Повернуть в комнату\n" +
            "4 — Продолжить движение по восточному коридору\n" +
            "5 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели горшок и ничего не нашли")
        } else if (choice === "2") {
            alert("Возле кирпича в стене вы нашли 15 монет")
            balance += 15
        } else if (choice === "3") {
            room = "Комната с сундуком"
        } else if (choice === "4") {
            room = "Продолжение восточного коридора"
        } else if (choice === "5") {
            showInventory();
        } else {
            alert("Такого прохода не существует.")
        }
    }
}

alert("Игра завершена.");