const inventory = [];
let room = "Вход";
let balance = 0;
let lever = false;
let firstQuestion = false;
let secondQuestion = false;
let thirdQuestion = false;

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

alert(
    "ЗАТЕРЯННОЕ КОРОЛЕВСТВО\n\n" +
    "Найдите зал босса и соберите вещи для упрощения битвы с ним:\n" +
    "ключ, магическую траву, магический меч, защитный амулет и священную лампу."
);

while (true) {
    if (room === "Вход") {
        const choice = prompt(
            "ВЫ У ВХОДА\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть мешок\n" +
            "3 — Осмотреть сундук\n" +
            "4 — Тюрьма - Западный коридор\n" +
            "5 — Центральный коридор\n" +
            "6 — Восточный коридор\n" +
            "7 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Горшок пуст.")
        } else if (choice === "2") {
            alert("Вы нашли 5 монет.")
            balance += 5
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            alert("Сундук пуст.")
        } else if (choice === "4") {
            alert("Вы отправились в Тюрьму - Западный коридор.")
            room = "Тюрьма - Западный коридор"
        } else if (choice === "5") {
            alert("Вы отправились в Центральный коридор.")
            room = "Центральный коридор"
        } else if (choice === "6") {
            alert("Вы отправились в Восточный коридор.")
            room = "Восточный коридор"
        } else if (choice == "7") {
            showInventory();
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Тюрьма - Западный коридор") {
        const choice = prompt(
            "ВЫ В ТЮРЬМЕ - ЗАПАДНОМ КОРИДОРЕ\n" +
            "1 — Осмотреть камеру №1\n" +
            "2 — Осмотреть камеру №2\n" +
            "3 — Осмотреть камеру №3\n" +
            "4 — Зайти в зал испытания\n" +
            "5 — Продолжить движение по западному коридору\n" +
            "6 — Проверить рюкзак\n" +
            "7 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы обыскали камеру №1 и нашли под кроватью 10 монет.")
            balance += 10
            alert(`На вашем балансе: ${balance} монет`)
        } else if (choice === "2") {
            alert("Вы обыскали камеру №2 и ничего в ней не нашли.")
        } else if (choice === "3") {
            if (inventory.includes("Магическая трава")) {
                alert("Вы уже обыскали это место.")
            } else {
                alert("Вы обыскали камеру №3 и нашли магическую траву.")
                inventory.push("Магическая трава")
            }
        } else if (choice === "4") {
            alert("Вы отправились в Зал испытаний.")
            room = "Зал испытаний"
        } else if (choice === "5") {
            alert("Вы отправились в коридор после тюрьмы.")
            room = "Коридор после тюрьмы"
        } else if (choice === "6") {
            showInventory();
        } else if (choice === "7") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Вход"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Зал испытаний") {
        const choice = prompt(
            "ВЫ В ЗАЛЕ ИСПЫТАНИЙ, ЧТОБЫ ПРОЙТИ ОТВЕТЬТЕ ПРАВИЛЬНО НА 3 ВОПРОСА\n" +
            "1 — Ответить на 1 вопрос\n" +
            "2 — Ответить на 2 вопрос\n" +
            "3 — Ответить на 3 вопрос\n" +
            "4 — Пройти в следующую комнату\n" +
            "5 — Проверить рюкзак\n" +
            "6 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            const firstAnswer = prompt("Что нужно осмотреть, чтобы найти Священную Лампу?")
            if (firstAnswer === "Балкон") {
                alert("Вы ответили правильно.")
                if (firstQuestion === true) {
                    alert("Вы уже ответили на вопрос №1 правильно.")
                }
                firstQuestion = true
            } else {
                alert("Неправильный ответ.")
            }
        } else if (choice === "2") {
            const secondAnswer = prompt("Сколько существует камер в Тюрьме - Западном коридоре?")
            if (secondAnswer === "3") {
                alert("Вы ответили правильно.")
                if (secondQuestion === true) {
                    alert("Вы уже ответили на вопрос №2 правильно.")
                }
                secondQuestion = true
            } else {
                alert("Неправильный ответ.")
            }
        } else if (choice === "3") {
            const thirdAnswer = prompt("Как называется вся локация?")
            if (thirdAnswer === "ЗАТЕРЯННОЕ КОРОЛЕВСТВО") {
                alert("Вы ответили правильно.")
                if (thirdQuestion === true) {
                    alert("Вы уже ответили на вопрос №3 правильно.")
                }
                thirdQuestion = true
            } else {
                alert("Неправильный ответ.")
            }
        } else if (choice === "4") {
            if (firstQuestion === true
                && secondQuestion === true
                && thirdQuestion === true
                && lever === true) {
                    alert("Вы выполнили все условия и прошли в закрытую комнату.")
                    if (inventory.includes("Защитный амулет")) {
                        alert("Вы уже получили защитный амулет.")
                    } else {
                        alert("Вы получаете защитный амулет.")
                        inventory.push("Защитный амулет")
                    }
                }
        } else if (choice === "5") {
            showInventory();
        } else if (choice === "6") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Тюрьма - Западный коридор"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Коридор после тюрьмы") {
        const choice = prompt(
            "ВЫ В ЦЕНТРАЛЬНОМ КОРИДОРЕ\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть мешок\n" +
            "3 — Пройти в западную комнату перед боссом\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели горшок и нашли 5 монет.")
            balance += 5
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "2") {
            alert("Вы осмотрели мешок и ничего не нашли.")
        } else if (choice === "3") {
            alert("Вы отправились в западную комнату перед боссом.")
            room = "Западная комната перед боссом"
        } 
        else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Тюрьма - Западный коридор"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Центральный коридор") {
        const choice = prompt(
            "ВЫ В ЦЕНТРАЛЬНОМ КОРИДОРЕ\n" +
            "1 — Использовать рычаг (может повлиять на последствия)\n" +
            "2 — Обыскать балкон\n" +
            "3 — Проверить рюкзак\n" +
            "4 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы дёрнули за рычаг и что-то произошло.")
            lever = true
        } else if (choice === "2") {
            if (inventory.includes("Священная лампа")) {
                alert("Вы уже обыскали это место.")
            } else {
                alert("Вы нашли священную лампу.")
                inventory.push("Священная лампа")
            }
        } else if (choice === "3") {
            showInventory();
        } else if (choice === "4") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Вход"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Восточный коридор") {
        const choice = prompt(
            "ВЫ В ВОСТОЧНОМ КОРИДОРЕ\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть кирпич в стене\n" +
            "3 — Повернуть в комнату\n" +
            "4 — Продолжить движение по восточному коридору\n" +
            "5 — Проверить рюкзак\n" +
            "6 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели горшок и ничего не нашли.")
        } else if (choice === "2") {
            alert("Возле кирпича в стене вы нашли 15 монет.")
            balance += 15
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            alert("Вы повернули в комнату.")
            room = "Комната с сундуком"
        } else if (choice === "4") {
            alert("Вы прошли мимо комнаты и отправились дальше по коридору.")
            room = "Продолжение восточного коридора"
        } else if (choice === "5") {
            showInventory();
        } else if (choice === "6") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Вход"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Комната с сундуком") {
        const choice = prompt(
            "ВЫ В КОМНАТЕ С СУНДУКОМ\n" +
            "1 — Осмотреть мешок\n" +
            "2 — Осмотреть горшок\n" +
            "3 — Открыть сундук\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели мешок и ничего не нашли.")
        } else if (choice === "2") {
            alert("Вы осмотрели горшок и нашли 5 монет.")
            balance += 5
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            if (inventory.includes("Магический меч")) {
                alert("Вы уже нашли Магический меч.")
            } else {
                alert("Вы нашли Магический меч.")
                inventory.push("Магический меч")
            }
        } else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Восточный коридор"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Продолжение восточного коридора") {
        const choice = prompt(
            "ВЫ В ПРОДОЛЖЕНИИ ВОСТОЧНОГО КОРИДОРА\n" +
            "1 — Осмотреть коридор\n" +
            "2 — Повернуть направо\n" +
            "3 — Осмотреть комнату в конце коридора\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели коридор и ничего не нашли.")
        } else if (choice === "2") {
            if (inventory.includes("Священная лампа")) {
                alert("Используя священную лампу, вы смогли пройти через комнату тьмы.")
                room = "Восточная комната перед боссом"
            }
            else {
                alert("Вы не можете пройти эту комнату, там слишком темно.")
            }
        } else if (choice === "3") {
            alert("Вы прошли в комнату в конце коридора.")
            room = "Комната в конце восточного коридора"
        } else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в начало коридора.")
            room = "Восточный коридор"
        }
        else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Комната в конце восточного коридора") {
        const choice = prompt(
            "ВЫ В ПОСЛЕДНЕЙ КОМНАТЕ ВОСТОЧНОГО КОРИДОРА\n" +
            "1 — Осмотреть мешок\n" +
            "2 — Осмотреть горшок\n" +
            "3 — Проверить рюкзак\n" +
            "4 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели мешок и ничего не нашли.")
        } else if (choice === "2") {
            if (inventory.includes("Ключ")) {
                alert("Вы уже подобрали ключ")
            } else {
                alert("Вы осмотрели горшок и нашли в нём Ключ.")
                inventory.push("Ключ")
            }
        } else if (choice === "3") {
            showInventory();
        } else if (choice === "4") {
            alert("Вы возвращаетесь в конец восточного коридора.")
            room = "Продолжение восточного коридора"
        }
        else {
            alert("Такого прохода не существует.")
        }
    }
}



alert("Игра завершена.");