const inventory = [];
let room = "Вход";
let balance = 0;
let lever = false;
let firstQuestion = false;
let secondQuestion = false;
let thirdQuestion = false;
let brick = false;
let eastDoor = false;
let playerNumber = 0;
let bossNumber = 0;

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

function getRandomInt(min, max) {
    return Math.floor(Math.random() * (max - min + 1)) + min;
}

alert(
    "ЗАТЕРЯННОЕ КОРОЛЕВСТВО\n\n" +
    "Найдите зал босса и соберите вещи для упрощения битвы с ним:\n" +
    "ключ, магическую траву, магический меч, защитный амулет и священную лампу."
);

while (true) {
    if (room === "Вход") {
        const choice = prompt(
            "ВЫ У ВХОДА\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть мешок\n" +
            "3 — Осмотреть сундук\n" +
            "4 — Тюрьма - Западный коридор\n" +
            "5 — Центральный коридор\n" +
            "6 — Восточный коридор\n" +
            "7 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Горшок пуст.")
        } else if (choice === "2") {
            alert("Вы нашли 5 монет.")
            balance += 5
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            alert("Сундук пуст.")
        } else if (choice === "4") {
            alert("Вы отправились в Тюрьму - Западный коридор.")
            room = "Тюрьма - Западный коридор"
        } else if (choice === "5") {
            alert("Вы отправились в Центральный коридор.")
            room = "Центральный коридор"
        } else if (choice === "6") {
            alert("Вы отправились в Восточный коридор.")
            room = "Восточный коридор"
        } else if (choice === "7") {
            showInventory();
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Тюрьма - Западный коридор") {
        const choice = prompt(
            "ВЫ В ТЮРЬМЕ - ЗАПАДНОМ КОРИДОРЕ\n" +
            "1 — Осмотреть камеру №1\n" +
            "2 — Осмотреть камеру №2\n" +
            "3 — Осмотреть камеру №3\n" +
            "4 — Зайти в зал испытания\n" +
            "5 — Продолжить движение по западному коридору\n" +
            "6 — Проверить рюкзак\n" +
            "7 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы обыскали камеру №1 и нашли под кроватью 10 монет.")
            balance += 10
            alert(`На вашем балансе: ${balance} монет`)
        } else if (choice === "2") {
            alert("Вы обыскали камеру №2 и ничего в ней не нашли.")
        } else if (choice === "3") {
            if (inventory.includes("Магическая трава")) {
                alert("Вы уже обыскали это место.")
            } else {
                alert("Вы обыскали камеру №3 и нашли магическую траву.")
                inventory.push("Магическая трава")
            }
        } else if (choice === "4") {
            alert("Вы отправились в Зал испытаний.")
            room = "Зал испытаний"
        } else if (choice === "5") {
            alert("Вы отправились в коридор после тюрьмы.")
            room = "Коридор после тюрьмы"
        } else if (choice === "6") {
            showInventory();
        } else if (choice === "7") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Вход"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Зал испытаний") {
        const choice = prompt(
            "ВЫ В ЗАЛЕ ИСПЫТАНИЙ, ЧТОБЫ ПРОЙТИ ОТВЕТЬТЕ ПРАВИЛЬНО НА 3 ВОПРОСА\n" +
            "1 — Ответить на 1 вопрос\n" +
            "2 — Ответить на 2 вопрос\n" +
            "3 — Ответить на 3 вопрос\n" +
            "4 — Пройти в следующую комнату\n" +
            "5 — Проверить рюкзак\n" +
            "6 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            const firstAnswer = prompt("Что нужно осмотреть, чтобы найти Священную Лампу?")
            if (firstAnswer === "Балкон") {
                alert("Вы ответили правильно.")
                if (firstQuestion === true) {
                    alert("Вы уже ответили на вопрос №1 правильно.")
                }
                else { firstQuestion = true }
            } else {
                alert("Неправильный ответ.")
            }
        } else if (choice === "2") {
            const secondAnswer = prompt("Сколько существует камер в Тюрьме - Западном коридоре?")
            if (secondAnswer === "3") {
                alert("Вы ответили правильно.")
                if (secondQuestion === true) {
                    alert("Вы уже ответили на вопрос №2 правильно.")
                }
                else { secondQuestion = true }
            } else {
                alert("Неправильный ответ.")
            }
        } else if (choice === "3") {
            const thirdAnswer = prompt("Как называется вся локация?")
            if (thirdAnswer === "ЗАТЕРЯННОЕ КОРОЛЕВСТВО") {
                alert("Вы ответили правильно.")
                if (thirdQuestion === true) {
                    alert("Вы уже ответили на вопрос №3 правильно.")
                }
                else { thirdQuestion = true }
            } else {
                alert("Неправильный ответ.")
            }
        } else if (choice === "4") {
            if (firstQuestion === true
                && secondQuestion === true
                && thirdQuestion === true
                && lever === true) {
                alert("Вы выполнили все условия и прошли в закрытую комнату.")
                if (inventory.includes("Защитный амулет")) {
                    alert("Вы уже получили защитный амулет.")
                } else {
                    alert("Вы получаете защитный амулет.")
                    inventory.push("Защитный амулет")
                }
            }
            else {
                alert("Вы не выполнили определённые условия, поэтому вы не можете пройти дальше")
            }
        } else if (choice === "5") {
            showInventory();
        } else if (choice === "6") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Тюрьма - Западный коридор"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Коридор после тюрьмы") {
        const choice = prompt(
            "ВЫ В КОРИДОРЕ ПОСЛЕ ТЮРЬМЫ\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть мешок\n" +
            "3 — Пройти в западную комнату перед боссом\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели горшок и нашли 5 монет.")
            balance += 5
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "2") {
            alert("Вы осмотрели мешок и ничего не нашли.")
        } else if (choice === "3") {
            alert("Вы отправились в западную комнату перед боссом.")
            room = "Западная комната перед боссом"
        }
        else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Тюрьма - Западный коридор"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Западная комната перед боссом") {
        const choice = prompt(
            "ВЫ В ЗАПАДНОЙ КОМНАТЕ ПЕРЕД БОССОМ\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть сундук\n" +
            "3 — Пройти в комнату с боссом\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели горшок и ничего не нашли.")
        } else if (choice === "2") {
            alert("Вы осмотрели сундук и 15 монет.")
            balance += 15
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            if (inventory.includes("Ключ")) {
                alert("Вы отправились в финальную комнату с боссом.")
                room = "Комната с боссом"
            } else {
                alert("Вы не можете пройти в комнату с боссом, так как дверь закрыта")
            }
        } else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Коридор после тюрьмы"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Центральный коридор") {
        const choice = prompt(
            "ВЫ В ЦЕНТРАЛЬНОМ КОРИДОРЕ\n" +
            "1 — Использовать рычаг (может повлиять на последствия)\n" +
            "2 — Обыскать балкон\n" +
            "3 — Проверить рюкзак\n" +
            "4 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            if (lever === true) {
                alert("Вы уже использовали рычаг.")
            } else {
                alert("Вы дёрнули за рычаг и что-то произошло.")
                lever = true
            }
        } else if (choice === "2") {
            if (inventory.includes("Священная лампа")) {
                alert("Вы уже обыскали это место.")
            } else {
                alert("Вы нашли священную лампу.")
                inventory.push("Священная лампа")
            }
        } else if (choice === "3") {
            showInventory();
        } else if (choice === "4") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Вход"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Восточный коридор") {
        const choice = prompt(
            "ВЫ В ВОСТОЧНОМ КОРИДОРЕ\n" +
            "1 — Осмотреть горшок\n" +
            "2 — Осмотреть кирпич в стене\n" +
            "3 — Повернуть в комнату\n" +
            "4 — Продолжить движение по восточному коридору\n" +
            "5 — Проверить рюкзак\n" +
            "6 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели горшок и ничего не нашли.")
        } else if (choice === "2") {
            alert("Возле кирпича в стене вы нашли 15 монет.")
            balance += 15
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            alert("Вы повернули в комнату.")
            room = "Комната с сундуком"
        } else if (choice === "4") {
            alert("Вы прошли мимо комнаты и отправились дальше по коридору.")
            room = "Продолжение восточного коридора"
        } else if (choice === "5") {
            showInventory();
        } else if (choice === "6") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Вход"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Комната с сундуком") {
        const choice = prompt(
            "ВЫ В КОМНАТЕ С СУНДУКОМ\n" +
            "1 — Осмотреть мешок\n" +
            "2 — Осмотреть горшок\n" +
            "3 — Открыть сундук\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели мешок и ничего не нашли.")
        } else if (choice === "2") {
            alert("Вы осмотрели горшок и нашли 5 монет.")
            balance += 5
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            if (inventory.includes("Магический меч")) {
                alert("Вы уже нашли Магический меч.")
            } else {
                alert("Вы нашли Магический меч.")
                inventory.push("Магический меч")
            }
        } else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Восточный коридор"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Продолжение восточного коридора") {
        const choice = prompt(
            "ВЫ В ПРОДОЛЖЕНИИ ВОСТОЧНОГО КОРИДОРА\n" +
            "1 — Осмотреть коридор\n" +
            "2 — Повернуть направо\n" +
            "3 — Осмотреть комнату в конце коридора\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели коридор и ничего не нашли.")
        } else if (choice === "2") {
            if (inventory.includes("Священная лампа")) {
                alert("Используя священную лампу, вы смогли пройти через комнату тьмы.")
                room = "Восточная комната перед боссом"
            }
            else {
                alert("Вы не можете пройти эту комнату, там слишком темно.")
            }
        } else if (choice === "3") {
            alert("Вы прошли в комнату в конце коридора.")
            room = "Комната в конце восточного коридора"
        } else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в начало коридора.")
            room = "Восточный коридор"
        }
        else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Восточная комната перед боссом") {
        const choice = prompt(
            "ВЫ В ВОСТОЧНОЙ КОМНАТЕ ПЕРЕД БОССОМ\n" +
            "1 — Осмотреть всю комнату\n" +
            "2 — Осмотреть сундук\n" +
            "3 — Пройти в комнату с боссом\n" +
            "4 — Проверить рюкзак\n" +
            "5 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели комнату и вдруг нашли подозрительный кирпич.")
            brick = confirm("Нажать на него?")
            if (brick === true) {
                alert("Внезапно открывается только что закрытая дверь, которая отделяет вас от комнаты босса.")
                eastDoor = true;
            } else {
                alert("Ничего не происходит.")
            }
        } else if (choice === "2") {
            alert("Вы осмотрели сундук и ничего не нашли.")
        } else if (choice === "3") {
            if (eastDoor === true) {
                alert("Вы проходите в комнату босса")
                room = "Комната с боссом"
            } else if (eastDoor === false) {
                if (inventory.includes("Ключ")) {
                    alert("Вы вставляете ключ в замочную скважину и вдруг оказывается, что он не подходит.")
                    alert("Вы не можете пройти в комнату с боссом, так как дверь закрыта")
                } else {
                    alert("Дверь перед вами закрыта, вы не можете её открыть.")
                }
            }
        } else if (choice === "4") {
            showInventory();
        } else if (choice === "5") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Продолжение восточного коридора"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Комната в конце восточного коридора") {
        const choice = prompt(
            "ВЫ В ПОСЛЕДНЕЙ КОМНАТЕ ВОСТОЧНОГО КОРИДОРА\n" +
            "1 — Осмотреть мешок\n" +
            "2 — Осмотреть горшок\n" +
            "3 — Проверить рюкзак\n" +
            "4 — Вернуться назад\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вы осмотрели мешок и ничего не нашли.")
        } else if (choice === "2") {
            if (inventory.includes("Ключ")) {
                alert("Вы уже подобрали ключ")
            } else {
                alert("Вы осмотрели горшок и нашли в нём Ключ.")
                inventory.push("Ключ")
            }
        } else if (choice === "3") {
            showInventory();
        } else if (choice === "4") {
            alert("Вы возвращаетесь в прошлую комнату.")
            room = "Продолжение восточного коридора"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Комната с боссом") {
        const choice = prompt(
            "ВЫ В ФИНАЛЬНОМ ЗАЛЕ\n" +
            "1 — Начать битву с боссом\n" +
            "2 — Осмотреть сундук\n" +
            "3 — Проверить рюкзак\n" +
            "4 — Вернуться в ВОСТОЧНУЮ КОМНАТУ ПЕРЕД ФИНАЛЬНЫМ ЗАЛОМ\n" +
            "5 — Вернуться в ЗАПАДНУЮ КОМНАТУ ПЕРЕД ФИНАЛЬНЫМ ЗАЛОМ\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert("Вдруг за вашей спиной появляется огромный рыцарь.")
            room = "Сражение с боссом"
        } else if (choice === "2") {
            alert("Вы осмотрели сундук и нашли 5 монет.")
            balance += 5
            alert(`На вашем балансе: ${balance} монет.`)
        } else if (choice === "3") {
            showInventory();
        } else if (choice === "4") {
            alert("Вы возвращаетесь в восточную комнату перед залом.")
            room = "Восточная комната перед боссом"
        } else if (choice === "5") {
            alert("Вы возвращаетесь в западную комнату перед залом.")
            room = "Западная комната перед боссом"
        } else {
            alert("Такого прохода не существует.")
        }
    }
    else if (room === "Сражение с боссом") {
        const choice = prompt(
            "ВЫ СТОИТЕ ПРЯМО ПЕРЕД РЫЦАРЕМ\n" +
            "1 — Попробовать откупиться\n" +
            "2 — Бежать в нападение\n" +
            "3 — Проверить рюкзак\n" +
            "0 — Завершить игру"
        );
        if (choice === "0") {
            break
        } else if (choice === "1") {
            alert(`У вас есть: ${balance} монет`)
            if (balance >= 60) {
                alert("С шансом 25% ты можешь откупиться от битвы.")
                playerNumber = getRandomInt(1, 4)
                bossNumber = getRandomInt(1, 4)
                if (playerNumber === bossNumber) {
                    alert("Рыцарь говорит: отдавай мне все монеты и беги отсюда так быстро, как только можешь.")
                    alert("С шансом 25% тебе повезло и ты смог выжить.")
                    alert("Рыцарь позволяет тебе сбежать.")
                    alert("Вы находите выход на свободу и бежите от замка так быстро, как не бегали никогда.")
                    break
                } else {
                    alert("Тебе не удалось откупиться, начинается битва.")
                }
            }
            else {
                alert("Вы не можете откупиться, так как у вас слишком мало монет.")
                alert("Начинается битва.")
            }
        } else if (choice === "2") {
            if (inventory.includes("Защитный амулет")
                && inventory.includes("Магическая трава")
                && inventory.includes("Магический меч")
                && inventory.includes("Священная лампа")
            ) {
                alert("Вы решаетесь на сражение и первым проявляете инициативу.")
                alert("С помощью священной лампы вы мгновенно ослепляете огромного рыцаря.")
                alert("Вы взбираетесь ему на спину и наносите магическим мечом 1-ый удар.")
                alert("Вдруг он поднимается и отбрасывает вас в стену.")
                alert("Вы используете магическую траву, чтобы залечить те раны, от которых не смог уберечь защитный амулет.")
                alert("Вы встаёте и отталкиваясь от стены запрыгиваете рыцарю на шею, нанося смертельный удар.")
                alert("Рыцарь погибает, вам открывается дверь на свободу.")
                alert("Вы прошли игру на хорошую концовку.")
                alert("P. S. Я не уверен что всё работает правильно (шутка)")
                break
            } else {
                alert("Так как у вас не хватало предметов, в ключевой момент вы не смогли защититься и вовремя нанести ответный удар.")
                alert("Вы погибли.")
                alert("Вы прошли игру на плохую концовку.")
                break
            }
        } else if (choice === "3") {
            showInventory();
        } else {
            alert("Такого прохода не существует.")
        }
    }
}
alert("Игра завершена.");